#رسم أشكال هندسية - التحدي الأول

# أكتب برنامج مهمته رسم الشكل التالي بواسطة الحلقات.
# عند تشغيل البرنامج, يجب أن يطلب من المستخدم إدخال عدد أسطر الشكل الذي سيتم رسمه.
# إنتبه: يجب أن يدخل المستخدم عدد أكبر من صفر, لأن عدد الأسطر لا يمكن أن يكون صفر أو أقل من صفر.
# *
# **
# ***
# ****
# *****
 n = 0
 while n <= 0:
    n = int(input('Enter the number of lines:'))

for i in range(1, n + 1):
    print('*' * i)

# أكتب برنامج مهمته رسم الشكل التالي بواسطة الحلقات.
# عند تشغيل البرنامج, يجب أن يطلب من المستخدم إدخال عدد أسطر الشكل الذي سيتم رسمه.
# إنتبه: يجب أن يدخل المستخدم عدد أكبر من صفر, لأن عدد الأسطر لا يمكن أن يكون صفر أو أقل من صفر.
 #    *
 #   **
 #  ***
 # ****
# *****
n = 0
while n <= 0:
    n = int(input('Enter the number of lines:'))

for i in range(1, n + 1):
    print(' ' * (n - i) + '*' * i)

# أكتب برنامج مهمته رسم الشكل التالي بواسطة الحلقات.
# عند تشغيل البرنامج, يجب أن يطلب من المستخدم إدخال عدد أسطر الشكل الذي سيتم رسمه.
# إنتبه: يجب أن يدخل المستخدم عدد أكبر من صفر, لأن عدد الأسطر لا يمكن أن يكون صفر أو أقل من صفر
# *****
# ****
# ***
# **
# *
n = 0
while n <= 0:
    n = int(input('Enter the number of lines:'))

for i in range(1, n + 1):
    print('*' * (n - i) + '*')
#
# أكتب برنامج مهمته رسم الشكل التالي بواسطة الحلقات.
# عند تشغيل البرنامج, يجب أن يطلب من المستخدم إدخال عدد أسطر الشكل الذي سيتم رسمه.
# إنتبه: يجب أن يدخل المستخدم عدد أكبر من صفر, لأن عدد الأسطر لا يمكن أن يكون صفر أو أقل من صفر
# *****
#  ****
#   ***
#    **
#     *
n = 0
while n <= 0:
    n = int(input('Enter the number of lines:'))

for i in range(1, n + 1):
    print(' ' * (i - 1) + '*' * (n - i + 1))

# أكتب برنامج مهمته رسم الشكل التالي بواسطة الحلقات.
# عند تشغيل البرنامج, يجب أن يطلب من المستخدم إدخال عدد أسطر و أعمدة الشكل الذي سيتم رسمه.
# إنتبه: يجب أن يدخل المستخدم عددين أكبر من صفر, لأن عدد أسطر و أعمدة الرسمة لا يمكن أن يكون صفر أو أقل من صفر.
#     ******
#    ******
#   ******
#  ******
# ******
n = 0
c = 0
while n <= 0:
    n = int(input('Enter the number of lines:'))

while c <= 0:
    c = int(input('Enter the number if columns: '))

for i in range(1, n + 1):
    print(' ' * (n - i) + '*' * ((c - n) + 1) + ' ' * (i - 1))

#in6days